<?php

$students = [
"ฐตวรรณ พงษ์พยัคฆ์",
"จีรัชญ์ ขวัญแก้ว",
"ชยางกูร เชื้อเจริญ",
"ไชยพศ จัดเจนนาวี",
"ปองคุณ อนุกิตติรัตน์",
"ศรัณยพงศ์ เอกอัครพรพล",
"รวิพล ฤกษ์สมบูรณ์ดี",
"วิธวินท์ หอมอ่อน",
"ตรัยรัตน์ ประทีปคีรี",
"ธาวิน ลาภสมบัติศิริ",
"วีรภัฏ หุณฑะสิริ",
"จิรายุ ชัยปรีชา",
"เอกราช ลุนณี",
"สิรวิชญ์ ว่องกีรติกุล",
"ฐิติวัชร์ เลิศทักษิณานนท์",
"เสฏพงศ์ สุวรรณวงศ์",
"ภคินธ์ ไชยเดช",
"ภณิตา พึ่งใจ",
"กาญจนา คชศิลา",
"พชรมน พลค้อ",
"ณัฐวิภา วงศ์ทองเครือ",
"ธิชานัน พลจอหอ",
"นันทิชา มาน้ำเที่ยง",
"อิษฎาอร โชคมงคลเสถียร",
"พิมพ์มาดา เที่ยงสั้น",
"สุวภัทร ปิงเมือง",
"ธนวินท์ ปัถวี",
"ปภังกร ลาภาศุภวัฒน์",
"พรพิพัฒน์ ตั้งวิโรจน์กุล",
"ภูมิฉัตร ปานทุ่ง",
"ไวภพ เพ็ญพันธ์นาค",
"ไอศูรย์ อนุศักดิ์ชัยกุล",
"วรท วงศ์คงสวัสดิ์",
"บึงพิพัฒน์ บึงไกร",
"พัทธนันท์ ประยูร",
"รุจิภาส แสงอ่อง",
"สรวิชญ์ ศรีลาออน",
"บุณยกร เฉลิมพรวิทิต",
"ชิษณุพงศ์ ถ้ำบุญรัฐเศรษฐ์",
"สรยุทธ บุตรวงค์"
];

echo "<h2>For Loop</h2>";

for ($i = 0; $i < count($students); $i++) {
    echo "เลขที่ ".($i+1)." : ".$students[$i]."<br>";
}

echo "<hr>";

echo "<h2>While Loop</h2>";

$i = 0;
while ($i < count($students)) {
    echo "เลขที่ ".($i+1)." : ".$students[$i]."<br>";
    $i++;
}

echo "<hr>";

echo "<h2>Foreach Loop</h2>";

$no = 1;
foreach ($students as $student) {
    echo "เลขที่ ".$no." : ".$student."<br>";
    $no++;
}

?>
